In [4]:
import pandas as pd
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [5]:
df.drop(['PassengerId', 'Name', 'SibSp', 'Parch', 'Ticket', 'Cabin', 'Embarked'], axis = 'columns', inplace = True)

In [7]:
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [21]:
targets=df.Survived
inputs=df.drop('Survived', axis='columns')

In [17]:
get_dummies

['Pclass', 'Sex', 'Age', 'Fare', 'Survived']

In [23]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [24]:
inputs = pd.concat([inputs,dummies], axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [28]:
inputs.drop('Sex', axis='columns', inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [30]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [32]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [34]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [49]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,targets,test_size=0.2)

In [50]:
len(X_train)

712

In [51]:
len(X_test)

179

In [52]:
len(inputs)

891

In [53]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [54]:
model.fit(X_train, y_train)

GaussianNB()

In [55]:
model.score(X_test, y_test)

0.7653631284916201

In [56]:
X_test[:10]

     Pclass        Age     Fare  female  male
767       3  30.500000   7.7500       1     0
824       3   2.000000  39.6875       0     1
117       2  29.000000  21.0000       0     1
587       1  60.000000  79.2000       0     1
478       3  22.000000   7.5208       0     1
360       3  40.000000  27.9000       0     1
470       3  29.699118   7.2500       0     1
110       1  47.000000  52.0000       0     1
883       2  28.000000  10.5000       0     1
226       2  19.000000  10.5000       0     1

In [57]:
y_test[:10]

767    0
824    0
117    0
587    1
478    0
360    0
470    0
110    0
883    0
226    1
Name: Survived, dtype: int64

In [58]:
model.predict(X_test[:10])

array([1, 0, 0, 0, 0, 0, 0, 0, 0, 0], dtype=int64)

In [59]:
model.predict_proba(X_test[:10])

array([[0.05069192, 0.94930808],
       [0.97486629, 0.02513371],
       [0.97902508, 0.02097492],
       [0.66539205, 0.33460795],
       [0.98972617, 0.01027383],
       [0.99026923, 0.00973077],
       [0.9907544 , 0.0092456 ],
       [0.87636967, 0.12363033],
       [0.97913573, 0.02086427],
       [0.97565272, 0.02434728]])

Spam Detection

In [63]:
import pandas as pd
df=pd.read_csv("spam.csv")
df.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [64]:
df.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [65]:
df['spam']=df['Category'].apply(lambda x: 1 if x=='spam' else 0)
df.head()

  Category                                            Message  spam
0      ham  Go until jurong point, crazy.. Available only ...     0
1      ham                      Ok lar... Joking wif u oni...     0
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...     1
3      ham  U dun say so early hor... U c already then say...     0
4      ham  Nah I don't think he goes to usf, he lives aro...     0

In [68]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(df.Message,df.spam, test_size=0.25)

In [71]:
from sklearn.feature_extraction.text import CountVectorizer
v = CountVectorizer()
X_train_count = v.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]], dtype=int64)

In [73]:
from sklearn.naive_bayes import MultinomialNB
model = MultinomialNB()
model.fit(X_train_count,y_train)

MultinomialNB()

In [75]:
emails = [
    'Hey mohan, can we get together to watch football game tommorow?',
    'Upto 20% discount on parking, exclusive offer just for you. Dont miss the reward!'
]
emails_count = v.transform(emails)
model.predict(emails_count)

array([0, 1], dtype=int64)

In [77]:
X_test_count = v.transform(X_test)
model.score(X_test_count, y_test)

0.9849246231155779

In [85]:
from sklearn.pipeline import Pipeline
clf = Pipeline([
    ('vectorizer', CountVectorizer()),
    ('nb', MultinomialNB())
])

In [86]:
clf.fit(X_train,y_train)

Pipeline(steps=[('vectorizer', CountVectorizer()), ('nb', MultinomialNB())])

In [87]:
clf.score(X_test, y_test)

0.9849246231155779

In [88]:
clf.predict(emails)

array([0, 1], dtype=int64)